Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/lunyu__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 子在齊聞韶，三月不知肉味，曰：「不圖爲樂之至於斯也！」
en: When the Master was in Ch'i, he heard the Shao, and for three months did not know the taste of flesh. "I did not think" he said, "that music could have been made so excellent as this."

source: 冉有曰：「夫子爲衞君乎？」子貢曰：「諾，吾將問之」。入曰：「伯夷叔齊，何人也？」曰：「古之賢人也。」曰：「怨乎？」曰：「求仁而得仁，又何怨？」出，曰：「夫子不爲也。」
en: Yen Yu said, "Is our Master for the ruler of Wei?" Tsze-kung said, "Oh! I will ask him." He went in accordingly, and said, "What sort of men were Po-i and Shu-ch'i?" "They were ancient worthies," said the Master. "Did they have any repinings because of their course?" The Master again replied, "They sought to act virtuously, and they did so; what was there for them to repine about?" On this, Tsze-kung went out and said, "Our Master is not for him."

source: 子曰：「飯疏食，飮水，曲肱而枕之，樂亦在其中矣。不義而富且貴，於我如浮雲。」
en: The Master said, "With coarse rice to eat, with water to drink, and my bended arm for a pillow;—I have still joy in the midst of these things. Riches and honours acquired by unrighteousness, are to me as a floating cloud."

source: 子曰：「加我數年，五十以學易，可以無大過矣。」
en: The Master said, "If some years were added to my life, I would give fifty to the study of the Yi, and then I might come to be without great faults."

source: 子所雅言：「詩、書、執禮，皆雅言也。」
en: The Master's frequent themes of discourse were—the Odes, the History, and the maintenance of the Rules of Propriety. On all these he frequently discoursed.

source: 葉公問孔子於子路，子路不對。子曰：「女奚不曰：『其爲人也，發憤忘食，樂以忘憂，不知老之將至云爾。』」
en: The Duke of Sheh asked Tsze-lu about Confucius, and Tsze-lu did not answer him. The Master said, "Why did you not say to him,—He is simply a man, who in his eager pursuit (of knowledge) forgets his food, who in the joy of its attainment forgets his sorrows, and who does not perceive that old age is coming on?"

source: 子曰：「我非生而知之者，好古，敏以求之者也。」
en: The Master said, "I am not one who was born in the possession of knowledge; I am one who is fond of antiquity, and earnest in seeking it there."

source: 子不語：怪、力、亂、神。
en: The subjects on which the Master did not talk, were—extraordinary things, feats of strength, disorder, and spiritual beings.

source: 子曰：「三人行，必有我師焉。擇其善者而從之，其不善者而改之。」
en: The Master said, "When I walk along with two others, they may serve me as my teachers. I will select their good qualities and follow them, their bad qualities and avoid them."

source: 子曰：「天生德於予，桓魋其如予何！」
en: The Master said, "Heaven produced the virtue that is in me. Hwan T'ui—what can he do to me?"

source: 子曰：「二三子，以我爲隱乎？吾無隱乎爾！吾無行而不與二三子者，是丘也。」
en: The Master said, "Do you think, my disciples, that I have any concealments? I conceal nothing from you. There is nothing which I do that is not shown to you, my disciples;—that is my way."

source: 子以四教：文、行、忠、信。
en: There were four things which the Master taught,—letters, ethics, devotion of soul, and truthfulness.

source: 子曰：「聖人，吾不得而見之矣！得見君子者，斯可矣。」子曰：「善人，吾不得而見之矣！得見有恆者，斯可矣。亡而爲有，虛而爲盈，約而爲泰，難乎有恆矣！」
en: The Master said, "A sage it is not mine to see; could I see a man of real talent and virtue, that would satisfy me." The Master said, "A good man it is not mine to see; could I see a man possessed of constancy, that would satisfy me. "Having not and yet affecting to have, empty and yet affecting to be full, straitened and yet affecting to be at ease:—it is difficult with such characteristics to have constancy."

source: 子釣而不綱，弋而不射宿。
en: The Master angled,—but did not use a net. He shot,—but not at birds perching.

source: 子曰：「蓋有不知而作之者，我無是也。多聞，擇其善者而從之，多見而識之，知之次也。」
en: The Master said, "There may be those who act without knowing why. I do not do so. Hearing much and selecting what is good and following it; seeing much and keeping it in memory:—this is the second style of knowledge."

source: 互鄉難與言。童子見，門人惑。子曰：「與其進也，不與其退也。唯何甚？人潔己以進，與其潔也，不保其往也！」
en: It was difficult to talk (profitably and reputably) with the people of Hu-hsiang, and a lad of that place having had an interview with the Master, the disciples doubted. The Master said, "I admit people's approach to me without committing myself as to what they may do when they have retired. Why must one be so severe? If a man purify himself to wait upon me, I receive him so purified, without guaranteeing his past conduct."

source: 子曰：「仁遠乎哉？我欲仁，斯仁至矣。」
en: The Master said, "Is virtue a thing remote? I wish to be virtuous, and lo! virtue is at hand."

source: 陳司敗問：「昭公知禮乎？」孔子對曰：「知禮。」孔子退，揖巫馬期而進之，曰：「吾聞君子不黨，君子亦黨乎？君取於吳爲同姓，謂之吳孟子。君而知禮，孰不知禮？」巫馬期以吿。子曰：「丘也幸，苟有過，人必知之。」
en: The minister of crime of Ch'an asked whether the duke Chao knew propriety, and Confucius said, "He knew propriety." Confucius having retired, the minister bowed to Wu-ma Ch'i to come forward, and said, "I have heard that the superior man is not a partisan. May the superior man be a partisan also? The prince married a daughter of the house of Wu, of the same surname with himself, and called her,—'The elder Tsze of Wu.' If the prince knew propriety, who does not know it?" Wu-ma Ch'i reported these remarks, and the Master said, "I am fortunate! If I have any errors, people are sure to know them."

source: 子與人歌而善，必使反之，而後和之。
en: When the Master was in company with a person who was singing, if he sang well, he would make him repeat the song, while he accompanied it with his own voice.

source: 子曰：「文，莫吾猶人也；躬行君子，則吾未之有得！」
en: The Master said, "In letters I am perhaps equal to other men, but the character of the superior man, carrying out in his conduct what he professes, is what I have not yet attained to."

source: 子曰：「若聖與仁，則吾豈敢？抑爲之不厭，誨人不倦，則可謂云爾已矣！」公西華曰：「正唯弟子不能學也！」
en: The Master said, "The sage and the man of perfect virtue;—how dare I rank myself with them? It may simply be said of me, that I strive to become such without satiety, and teach others without weariness." Kung-hsi Hwa said, "This is just what we, the disciples, cannot imitate you in."

source: 子疾病，子路請禱。子曰：「有諸？」子路對曰：「有之。誄曰：『禱爾于上下神祇。』子曰：「丘之禱久矣！」
en: The Master being very sick, Tsze-lu asked leave to pray for him. He said, "May such a thing be done?" Tsze-lu replied, "It may. In the Eulogies it is said, 'Prayer has been made for thee to the spirits of the upper and lower worlds.'" The Master said, "My praying has been for a long time."

source: 子曰：「奢則不孫，儉則固；與其不孫也，甯固。」
en: The Master said, "Extravagance leads to insubordination, and parsimony to meanness. It is better to be mean than to be insubordinate."

source: 子曰：「君子坦蕩蕩，小人長戚戚。」
en: The Master said, "The superior man is satisfied and composed; the mean man is always full of distress."

source: 子溫而厲，威而不猛，恭而安。===校勘記===
en: The Master was mild, and yet dignified; majestic, and yet not fierce; respectful, and yet easy.

source: 子曰：「泰伯，其可謂至德也已矣！三以天下讓，民無得而稱焉。」
en: The Master said, "T'ai-po may be said to have reached the highest point of virtuous action. Thrice he declined the kingdom, and the people in ignorance of his motives could not express their approbation of his conduct."

source: 子曰：「恭而無禮則勞，愼而無禮則葸，勇而無禮則亂，直而無禮則絞。君子篤於親，則民興於仁。故舊不遺，則民不偷。」
en: The Master said, "Respectfulness, without the rules of propriety, becomes laborious bustle; carefulness, without the rules of propriety, becomes timidity; boldness, without the rules of propriety, becomes insubordination; straightforwardness, without the rules of propriety, becomes rudeness. "When those who are in high stations perform well all their duties to their relations, the people are aroused to virtue. When old friends are not neglected by them, the people are preserved from meanness."

source: 曾子有疾，召門弟子曰：「啟予足！啟予手！詩云：『戰戰兢兢，如臨深淵，如履薄冰。』而今而後，吾知免夫！小子！」
en: The philosopher Tsang being ill, he called to him the disciples of his school, and said, "Uncover my feet, uncover my hands. It is said in the Book of Poetry, 'We should be apprehensive and cautious, as if on the brink of a deep gulf, as if treading on thin ice,' and so have I been. Now and hereafter, I know my escape from all injury to my person, O ye, my little children."

source: 曾子有疾，孟敬子問之。曾子言曰：「鳥之將死，其鳴也哀，人之將死，其言也善。君子所貴乎道者三：動容貌，斯遠暴慢矣；正顏色，斯近信矣；出辭氣，斯遠鄙倍矣；籩豆之事，則有司存。」
en: The philosopher Tsang being ill, Meng Chang went to ask how he was. Tsang said to him, "When a bird is about to die, its notes are mournful; when a man is about to die, his words are good. "There are three principles of conduct which the man of high rank should consider specially important:—that in his deportment and manner he keep from violence and heedlessness; that in regulating his countenance he keep near to sincerity; and that in his words and tones he keep far from lowness and impropriety. As to such matters as attending to the sacrificial vessels, there are the proper officers for them."

source: 曾子曰：「以能問於不能，以多問於寡，有若無，實若虛，犯而不校。昔者吾友，嘗從事於斯矣。」
en: The philosopher Tsang said, "Gifted with ability, and yet putting questions to those who were not so; possessed of much, and yet putting questions to those possessed of little; having, as though he had not; full, and yet counting himself as empty; offended against, and yet entering into no altercation; formerly I had a friend who pursued this style of conduct."

source: 曾子曰：「可以託六尺之孤，可以寄百里之命，臨大節而不可奪也。君子人與？君子人也！」
en: The philosopher Tsang said, "Suppose that there is an individual who can be entrusted with the charge of a young orphan prince, and can be commissioned with authority over a state of a hundred li, and whom no emergency however great can drive from his principles:—is such a man a superior man? He is a superior man indeed."

source: 曾子曰：「士不可以不弘毅，任重而道遠。仁以爲己任，不亦重乎；死而後已，不亦遠乎。」
en: The philosopher Tsang said, "The officer may not be without breadth of mind and vigorous endurance. His burden is heavy and his course is long. "Perfect virtue is the burden which he considers it is his to sustain;—is it not heavy? Only with death does his course stop;—is it not long?

source: 子曰：「興於詩，立於禮，成於樂。」
en: The Master said, "It is by the Odes that the mind is aroused. "It is by the Rules of Propriety that the character is established. "It is from Music that the finish is received."

source: 子曰：「民可使由之，不可使知之。」
en: The Master said, "The people may be made to follow a path of action, but they may not be made to understand it."

source: 子曰：「好勇疾貧，亂也。人而不仁，疾之已甚，亂也。」
en: The Master said, "The man who is fond of daring and is dissatisfied with poverty, will proceed to insubordination. So will the man who is not virtuous, when you carry your dislike of him to an extreme."

source: 子曰：「如有周公之才之美，使驕且吝，其餘不足觀也已！」
en: The Master said, "Though a man have abilities as admirable as those of the Duke of Chau, yet if he be proud and niggardly, those other things are really not worth being looked at."

source: 子曰：「三年學，不至於穀，不易得也。」
en: The Master said, "It is not easy to find a man who has learned for three years without coming to be good."

source: 子曰：「篤信好學，守死善道。危邦不入，亂邦不居。天下有道則見，無道則隱。邦有道，貧且賤焉，恥也；邦無道，富且貴焉，恥也。」
en: The Master said, "With sincere faith he unites the love of learning; holding firm to death, he is perfecting the excellence of his course. "Such an one will not enter a tottering State, nor dwell in a disorganized one. When right principles of government prevail in the kingdom, he will show himself; when they are prostrated, he will keep concealed. "When a country is well-governed, poverty and a mean condition are things to be ashamed of. When a country is ill-governed, riches and honour are things to be ashamed of."

source: 子曰：「不在其位，不謀其政。」
en: The Master said, "He who is not in any particular office, has nothing to do with plans for the administration of its duties."

source: 子曰：「師摯之始，關雎之亂，洋洋乎，盈耳哉！」
en: The Master said, "When the music master Chih first entered on his office, the finish of the Kwan Tsu was magnificent;—how it filled the ears!"

source: 子曰：「狂而不直，侗而不愿，悾悾而不信，吾不知之矣！」
en: The Master said, "Ardent and yet not upright; stupid and yet not attentive; simple and yet not sincere:—such persons I do not understand."

source: 子曰：「學如不及，猶恐失之。」
en: The Master said, "Learn as if you could not reach your object, and were always fearing also lest you should lose it."

source: 子曰：「巍巍乎，舜、禹之有天下也，而不與焉。」
en: The Master said, "How majestic was the manner in which Shun and Yu held possession of the empire, as if it were nothing to them!"

source: 子曰：「大哉，堯之爲君也！巍巍乎，唯天爲大，唯堯則之！蕩蕩乎，民無能名焉！巍巍乎，其有成功也！煥乎，其有文章！」
en: The Master said, "Great indeed was Yao as a sovereign! How majestic was he! It is only Heaven that is grand, and only Yao corresponded to it. How vast was his virtue! The people could find no name for it. "How majestic was he in the works which he accomplished! How glorious in the elegant regulations which he instituted!"

source: 舜有臣五人，而天下治。武王曰：「予有亂臣十人。」孔子曰：「『才難』，不其然乎？唐虞之際，於斯爲盛，有婦人焉，九人而已。三分天下有其二，以服事殷、周之德，其可謂至德也已矣！」
en: Shun had five ministers, and the empire was well-governed. King Wu said, "I have ten able ministers." Confucius said, "Is not the saying that talents are difficult to find, true? Only when the dynasties of T'ang and Yu met, were they more abundant than in this of Chau, yet there was a woman among them. The able ministers were no more than nine men. "King Wan possessed two of the three parts of the empire, and with those he served the dynasty of Yin. The virtue of the house of Chau may be said to have reached the highest point indeed."

source: 子曰：「禹，吾無間然矣！菲飮食，而致孝乎鬼神；惡衣服，而致美乎黻冕；卑宮室，而盡力乎溝洫。禹，吾無間然矣！」
en: The Master said, "I can find no flaw in the character of Yu. He used himself coarse food and drink, but displayed the utmost filial piety towards the spirits. His ordinary garments were poor, but he displayed the utmost elegance in his sacrificial cap and apron. He lived in a low mean house, but expended all his strength on the ditches and water-channels. I can find nothing like a flaw in Yu."

source: 子罕言利與命與仁。
en: The subjects of which the Master seldom spoke were—profitableness, and also the appointments of Heaven, and perfect virtue.

source: 達巷黨人曰：「大哉孔子！博學而無所成名。」子聞之，謂門弟子曰：「吾何執？執御乎？執射乎？吾執御矣！」
en: A man of the village of Ta-hsiang said, "Great indeed is the philosopher K'ung! His learning is extensive, and yet he does not render his name famous by any particular thing." The Master heard the observation, and said to his disciples, "What shall I practise? Shall I practise charioteering, or shall I practise archery? I will practise charioteering."

source: 子曰：「麻冕，禮也；今也純，儉，吾從眾。拜下，禮也；今拜乎上，泰也。雖違眾，吾從下。」
en: The Master said, "The linen cap is that prescribed by the rules of ceremony, but now a silk one is worn. It is economical, and I follow the common practice. "The rules of ceremony prescribe the bowing below the hall, but now the practice is to bow only after ascending it. That is arrogant. I continue to bow below the hall, though I oppose the common practice."

source: 子絕四：「毋意，毋必，毋固，毋我。」
en: There were four things from which the Master was entirely free. He had no foregone conclusions, no arbitrary predeterminations, no obstinacy, and no egoism.

source: 子畏於匡。曰：「文王既沒，文不在茲乎？天之將喪斯文也，後死者，不得與於斯文也。天之未喪斯文也，匡人其如予何？」
en: The Master was put in fear in K'wang. He said, "After the death of King Wan, was not the cause of truth lodged here in me? "If Heaven had wished to let this cause of truth perish, then I, a future mortal, should not have got such a relation to that cause. While Heaven does not let the cause of truth perish, what can the people of K'wang do to me?"

source: 大宰問於子貢曰：「夫子聖者與？何其多能也？」子貢曰：「固天縱之將聖，又多能也。」子聞之曰：「大宰知我乎！吾少也賤，故多能鄙事。君子多乎哉？不多也！」
en: A high officer asked Tsze-kung, saying, "May we not say that your Master is a sage? How various is his ability!" Tsze-kung said, "Certainly Heaven has endowed him unlimitedly. He is about a sage. And, moreover, his ability is various." The Master heard of the conversation and said, "Does the high officer know me? When I was young, my condition was low, and therefore I acquired my ability in many things, but they were mean matters. Must the superior man have such variety of ability? He does not need variety of ability." Lao said, "The Master said, 'Having no official employment, I acquired many arts.'"

source: 牢曰：「子云：『吾不試，故藝。』」
en: The Master said, "Am I indeed possessed of knowledge? I am not knowing. But if a mean person, who appears quite empty-like, ask anything of me, I set it forth from one end to the other, and exhaust it."

source: 子曰：「吾有知乎哉？無知也。有鄙夫問於我，空空如也，我扣其兩端而竭焉。」
en: The Master said, "The fang bird does not come; the river sends forth no map:—it is all over with me!"

source: 子曰：「鳳鳥不至，河不出圖，吾已矣夫！」
en: When the Master saw a person in a mourning dress, or any one with the cap and upper and lower garments of full dress, or a blind person, on observing them approaching, though they were younger than himself, he would rise up, and if he had to pass by them, he would do so hastily.

source: 子見齊衰者，冕衣裳者，與瞽者，見之，雖少必作，過之必趨。
en: Yen Yuan, in admiration of the Master's doctrines, sighed and said, "I looked up to them, and they seemed to become more high; I tried to penetrate them, and they seemed to become more firm; I looked at them before me, and suddenly they seemed to be behind. "The Master, by orderly method, skilfully leads men on. He enlarged my mind with learning, and taught me the restraints of propriety. "When I wish to give over the study of his doctrines, I cannot do so, and having exerted all my ability, there seems something to stand right up before me; but though I wish to follow and lay hold of it, I really find no way to do so."

source: 顏淵喟然歎曰：「仰之彌高，鑽之彌堅，瞻之在前，忽焉在後！夫子循循然善誘人：博我以文，約我以禮。欲罷不能，既竭吾才，如有所立卓爾，雖欲從之，末由也已！」
en: The Master being very ill, Tsze-lu wished the disciples to act as ministers to him. During a remission of his illness, he said, "Long has the conduct of Yu been deceitful! By pretending to have ministers when I have them not, whom should I impose upon? Should I impose upon Heaven? "Moreover, than that I should die in the hands of ministers, is it not better that I should die in the hands of you, my disciples? And though I may not get a great burial, shall I die upon the road?"

source: 子疾病，子路使門人爲臣。病間，曰：「久矣哉，由之行詐也！無臣而爲有臣，吾誰欺？欺天乎？且予與其死於臣之手也，無寧死於二三子之手乎！且予縱不得大葬，予死於道路乎？」
en: Tsze-kung said, "There is a beautiful gem here. Should I lay it up in a case and keep it? or should I seek for a good price and sell it?" The Master said, "Sell it! Sell it! But I would wait for one to offer the price."

source: 子貢曰：「有美玉於斯，韞櫝而藏諸？求善賈而沽諸？」子曰：「沽之哉！沽之哉！我待賈者也！」
en: The Master was wishing to go and live among the nine wild tribes of the east. Some one said, "They are rude. How can you do such a thing?" The Master said, "If a superior man dwelt among them, what rudeness would there be?"

source: 子欲居九夷。或曰：「陋，如之何？」子曰：「君子居之，何陋之有？」
en: The Master said, "I returned from Wei to Lu, and then the music was reformed, and the pieces in the Royal songs and Praise songs all found their proper places."

source: 子曰：「吾自衞反魯，然後樂正，雅頌各得其所。」
en: The Master said, "Abroad, to serve the high ministers and nobles; at home, to serve one's father and elder brothers; in all duties to the dead, not to dare not to exert one's self; and not to be overcome of wine:—which one of these things do I attain to?"

source: 子曰：「出則事公卿，入則事父兄，喪事不敢不勉，不爲酒困，何有於我哉？」
en: The Master standing by a stream, said, "It passes on just like this, not ceasing day or night!"

source: 子在川上曰：「逝者如斯夫！不舍晝夜。」
en: The Master said, "I have not seen one who loves virtue as he loves beauty."

source: 子曰：「吾未見好德如好色者也。」
en: The Master said, "The prosecution of learning may be compared to what may happen in raising a mound. If there want but one basket of earth to complete the work, and I stop, the stopping is my own work. It may be compared to throwing down the earth on the level ground. Though but one basketful is thrown at a time, the advancing with it is my own going forward."

source: 子曰：「譬如爲山，未成一簣，止，吾止也！譬如平地，雖覆一簣，進，吾往也！」
en: The Master said, "Never flagging when I set forth anything to him;—ah! that is Hui."

source: 子曰：「語之而不惰者，其回也與！」
en: The Master said of Yen Yuan, "Alas! I saw his constant advance. I never saw him stop in his progress."

source: 子謂顏淵，曰：「惜乎！吾見其進也，未見其止也！」
en: The Master said, "There are cases in which the blade springs, but the plant does not go on to flower! There are cases where it flowers, but no fruit is subsequently produced!"

source: 子曰：「苗而不秀者，有矣夫！秀而不實者，有矣夫！」
en: The Master said, "A youth is to be regarded with respect. How do we know that his future will not be equal to our present? If he reach the age of forty or fifty, and has not made himself heard of, then indeed he will not be worth being regarded with respect."

source: 子曰：「後生可畏，焉知來者之不如今也？四十、五十而無聞焉，斯亦不足畏也已！」
en: The Master said, "Can men refuse to assent to the words of strict admonition? But it is reforming the conduct because of them which is valuable. Can men refuse to be pleased with words of gentle advice? But it is unfolding their aim which is valuable. If a man be pleased with these words, but does not unfold their aim, and assents to those, but does not reform his conduct, I can really do nothing with him."

source: 子曰：「法語之言，能無從乎？改之爲貴。巽與之言，能無說乎？繹之爲貴。說而不繹，從而不改，吾末如之何也已矣！」
en: The Master said, "Hold faithfulness and sincerity as first principles. Have no friends not equal to yourself. When you have faults, do not fear to abandon them."

source: 子曰：「主忠信，毋友不如己者，過則勿憚改。」
en: The Master said, "The commander of the forces of a large state may be carried off, but the will of even a common man cannot be taken from him."

source: 子曰：「三軍可奪帥也，匹夫不可奪志也。」
en: The Master said, "Dressed himself in a tattered robe quilted with hemp, yet standing by the side of men dressed in furs, and not ashamed;—ah! it is Yu who is equal to this! "'He dislikes none, he covets nothing;—what can he do but what is good!'" Tsze-lu kept continually repeating these words of the ode, when the Master said, "Those things are by no means sufficient to constitute (perfect) excellence."

source: 子曰：「衣敝縕袍，與衣狐貉者立，而不恥者，其由也與！『不忮不求，何用不臧？』子路終身誦之。子曰：「是道也，何足以臧？」
en: The Master said, "When the year becomes cold, then we know how the pine and the cypress are the last to lose their leaves."

source: 子曰：「歲寒，然後知松柏之後凋也。」
en: The Master said, "The wise are free from perplexities; the virtuous from anxiety; and the bold from fear."

source: 子曰：「知者不惑，仁者不憂，勇者不懼。」
en: The Master said, "There are some with whom we may study in common, but we shall find them unable to go along with us to principles. Perhaps we may go on with them to principles, but we shall find them unable to get established in those along with us. Or if we may get so established along with them, we shall find them unable to weigh occurring events along with us."

source: 子曰：「可與共學，未可與適道；可與適道，未可與立；可與立，未可與權。」
en: How the flowers of the aspen-plum flutter and turn! Do I not think of you? But your house is distant.

source: 「唐棣之華，偏其反而；豈不爾思？室是遠而」。子曰：「未之思也，夫何遠之有？」
en: The Master said, "It is the want of thought about it. How is it distant?"

source: 孔子於鄉黨，恂恂如也，似不能言者。其在宗廟朝廷，便便言，唯謹爾。
en: Confucius, in his village, looked simple and sincere, and as if he were not able to speak. When he was in the prince's ancestorial temple, or in the court, he spoke minutely on every point, but cautiously.

source: 朝與下大夫言，侃侃如也；與上大夫言，誾誾如也。君在，踧踖如也，與與如也。
en: When he was waiting at court, in speaking with the great officers of the lower grade, he spake freely, but in a straightforward manner; in speaking with those of the higher grade, he did so blandly, but precisely. When the ruler was present, his manner displayed respectful uneasiness; it was grave, but self-possessed.
